export interface Gadget {
  id: number;
  name: string;
  category: string;
  price: string;
  image: string;
  description: string; // Короткое описание для карточки
  fullDescription: string; // Полное описание для модального окна
  link?: string;
}

export const GADGETS_DATA: Gadget[] = [
  {
    id: 1,
    name: "Автокормушка с AI-камерой (Petkit YumShare)",
    category: "Кормление",
    price: "- ₽",
    image: "assets/gadgets/fooder.webp",
    description: "Умная подача корма с Full HD камерой и нейросетью для контроля питания.",
    fullDescription: "Внутри герметичного корпуса находится резервуар для сухого корма и роторный механизм с защитой от застревания гранул. Встроенная Full HD камера с углом обзора 140° и ночным видением не просто транслирует видео, а с помощью нейросети распознает активность питомца, автоматически записывает короткие видео приемов пищи и присылает уведомления. Системы с двойным баком (Dual Hopper) умеют смешивать разные виды корма или лечебные гранулы.",
    link: "#"
  },
  {
    id: 2,
    name: "Умный фонтан (PETLIBRO Dockstream)",
    category: "Здоровье",
    price: "- ₽",
    image: "assets/gadgets/poilka.jpg",
    description: "Бесшумный фонтан с многослойной фильтрацией и контролем потребления воды.",
    fullDescription: "Беспроводной погружной насос гонит воду через систему из активированного угля, ионообменной смолы и сетки, задерживая шерсть и запахи. Продвинутые версии оснащены датчиками веса или RFID-модулями: если надеть на ошейники специальные метки, приложение покажет точную статистику потребления воды для каждого питомца за сутки. Уровень шума всего 23 дБ.",
    link: "#"
  },
  {
    id: 3,
    name: "Самоочищающийся лоток (PETKIT Pura Max)",
    category: "Гигиена",
    price: "- ₽",
    image: "assets/gadgets/lotok.webp",
    description: "Полная автоматизация уборки с системой дезодорации и датчиками безопасности.",
    fullDescription: "Закрытая кабина-барабан, которая медленно вращается после посещения кошки. Наполнитель проходит сквозь внутреннее сито: чистые гранулы остаются, а отходы отсеиваются в изолированный отсек. Лоток оснащен инфракрасными сенсорами и датчиками веса, которые мгновенно останавливают вращение при входе животного. Встроенный спрей автоматически распыляет очищающий раствор.",
    link: "#"
  },
  {
    id: 4,
    name: "GPS-трекер (Tractive Smart GPS)",
    category: "Безопасность",
    price: "- ₽",
    image: "assets/gadgets/traker.avif",
    description: "Спутниковое отслеживание в реальном времени и мониторинг активности питомца.",
    fullDescription: "Влагозащищенный блок (IPX7) фиксируется на ошейнике. Комбинирует GPS/ГЛОНАСС и встроенную SIM-карту. В приложении можно настроить «виртуальный забор» — при выходе за его границы владелец получит уведомление. Встроенный акселерометр отслеживает фазы сна и считает время активного бега, собирая полную фитнес-статистику.",
    link: "#"
  }
];
